## DNS
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success`





```terraform
Plan: 1 to add, 0 to change, 0 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_route53_record.lambda-api-notification-canada-ca-A will be created
  + resource "aws_route53_record" "lambda-api-notification-canada-ca-A" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "api.notification.canada.ca"
      + records         = [
          + "d-jwtzdgd9qg.execute-api.ca-central-1.amazonaws.com",
        ]
      + set_identifier  = "lambda"
      + ttl             = 60
      + type            = "CNAME"
      + zone_id         = "Z1XG153PQF3VV5"

      + weighted_routing_policy {
          + weight = 0
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------

This plan was saved to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"


```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_route53_zone.alpha-canada-ca-public"]
WARN - plan.json - main - Missing Common Tags: ["aws_route53_zone.cds-snc-ca-public"]
WARN - plan.json - main - Missing Common Tags: ["aws_route53_zone.notification-canada-ca-public"]

11 tests, 8 passed, 3 warnings, 0 failures, 0 exceptions

```

</details>
